export default [
    {
        url: "/api/musicList",
        method: "get",
        response: () => {
            return {
                code: 0,
                message: "ok",
                data: [
                    {
                        url: "/src/assets/gouzhiqishi-lingyuan.mp3",
                        pic: "/src/assets/lingyuan2019-130.jpg",
                        title: "勾指起誓",
                        singer: "泠鸢",
                        source: "【泠鸢翻唱2019】",
                        lyric: "[00:00.000] 作词 : ilem\n[00:01.000] 作曲 : ilem\n[00:02.652]编曲：ilem\n[00:11.152]洛天依调校：ilem\n[00:13.653]P V：PinoEliza(明暗像素)\n[00:16.651]原唱：洛天依\n[00:19.401]翻唱：泠鸢yousa\n[00:21.651]你是信的开头诗的内容\n[00:25.151]童话的结尾\n[00:27.151]你是理所当然的奇迹\n[00:30.652]你是月色真美\n[00:32.902]你是圣诞老人送给我\n[00:36.401]好孩子的礼物\n[00:38.400]你是三千美丽世界里\n[00:42.150]我的一瓢水\n[00:44.150]所以让我再靠近一点点\n[00:47.401]因为你太温暖\n[00:49.901]我会再变得坚强一点点\n[00:53.430]因为你太柔软\n[00:55.430]交换无名指金色的契约\n[00:58.930]给彼此岁月\n[01:01.180]说好从今以后都牵着手\n[01:04.681]因为要走很远\n[01:29.178]你是我万水千山的冒险\n[01:32.928]要找的标记点\n[01:35.076]你是我分割人生的线\n[01:38.326]又将它们相连\n[01:40.326]你是前世千次的回眸\n[01:44.325]虔诚牵的手\n[01:46.325]你是其余所有的一切\n[01:49.825]是我的世界\n[01:52.075]所以请你再闪亮一点点\n[01:55.325]尽管我太平凡\n[01:57.576]我会再变得柔软一点点\n[02:01.075]因为你太敏感\n[02:03.324]交换无名指金色的契约\n[02:06.825]给彼此岁月\n[02:09.074]说好从今以后都牵着手\n[02:12.075]不管要走多远\n[02:37.548]所以让我再靠近一点点\n[02:40.298]因为你太温暖\n[02:42.798]我会再变得坚强一点点\n[02:46.297]因为你太柔软\n[02:48.297]交换无名指金色的契约\n[02:52.048]给彼此岁月\n[02:54.297]说好从今以后都牵着手\n[02:57.797]因为要走很远\n"
                    },
                    {
                        url: "/src/assets/tianluo-lingyuan.mp3",
                        pic: "/src/assets/lingyuan2019-130.jpg",
                        title: "田螺【泠鸢翻唱】",
                        singer: "泠鸢",
                        source: "【泠鸢翻唱2019】",
                        lyric: "[00:00.000] 作词 : 风予荷/假寐\n[00:00.223] 作曲 : 殇小谨\n[00:00.446]翻唱：泠鸢yousa / 原唱：王梓钰\n[00:03.696]作曲 : 殇小谨\n[00:06.445]作词 : 风予荷/假寐\n[00:09.197]编曲：于瑾\n[00:12.197]\n[00:12.696]曾听人说书\n[00:14.195]书生忠厚 幸有 入室田螺\n[00:17.696]寒时添衣忙\n[00:19.446]炊烟袅袅 更有 华章书就\n[00:22.445]\n[00:22.944]媒妁说亲\n[00:24.194]婉拒所求\n[00:26.695]今意有所属 斗室内 恕不远游\n[00:33.132]\n[00:33.631]亲朋皆诧异\n[00:35.381]室内何人 如鱼 离水难游\n[00:38.882]螺幻烟聚袖\n[00:40.881]长身玉立 盈盈 赴约而守\n[00:43.882]\n[00:44.132]世人祝祷\n[00:45.636]求女如 此\n[00:47.880]祈一世安福 乐齐人 百岁无忧\n[00:53.631]\n[00:53.879]招远城中知 罗氏有女\n[00:56.381]有公子登门 誓诺白头\n[00:59.129]奉上千金裘\n[01:01.880]再寄百碗酒\n[01:04.130]\n[01:04.381]不系公子心 明珠非我\n[01:07.130]宝玉亦非我 花下低酌\n[01:09.879]明月照拂我\n[01:12.380]寒夜笼住我\n[01:15.880]\n[01:37.628]听闻阿娘言\n[01:39.627]姻谱天定 今生 且等且候\n[01:42.877]梦中曾邂逅\n[01:44.627]凛风痴沐 冰雪 不舍放手\n[01:47.877]\n[01:48.378]又梦为君\n[01:49.879]闲时温书\n[01:52.127]素手作羹汤 与君旁 心皆滚烫\n[01:57.626]\n[01:57.876]燃起烛如火 夜夜如旧\n[02:00.376]山外望小楼 明明如昼\n[02:03.127]愿春暖不朽\n[02:05.626]醒时却乌有\n[02:08.126]\n[02:08.627]罗府迎远客 白头翁皱\n[02:11.127]自言本姓谢 端字名后\n[02:13.625]眼中深似海\n[02:16.627]苦行千里久\n[02:21.125]\n[02:44.624]勾我前尘忆 冰雪尽融\n[02:47.124]前世君渡我 我为君眸\n[02:49.874]岁岁眉间留\n[02:52.373]绿春与白秋\n[02:54.873]\n[02:55.123]相隔六十载 青梅重萌\n[02:57.873]阔别君已久 一见情囚\n[03:00.373]世间无田螺\n[03:03.123]世间多田螺\n[03:05.872]\n[03:06.373]贝斯：高郡邦\n[03:09.124]吉他：牛子健\n[03:11.873]古筝：紫格\n[03:14.621]笛子：囚牛\n[03:17.122]和声：皎月\n"
                    },
                    {
                        url: "/src/assets/bishaji-axi.mp3",
                        pic: "/src/assets/axi130.jpg",
                        title: "必杀技",
                        singer: "阿细",
                        source: "必杀技",
                        lyric: "[00:07.886]你近来又再有空\n[00:11.070]我在防备别发功\n[00:14.256]能勉强戒绝心痛\n[00:17.981]但喉咙还在痛\n[00:21.696]你再怀旧我也懂\n[00:24.880]还称赞我够上进\n[00:28.604]但可惜那时你都不相信\n[00:35.505]我道行都低估了你\n[00:38.701]我以为撑得起\n[00:42.418]一句为什么不找找你\n[00:45.867]我练到再倔强 再绝也\n[00:48.533]也永没法比\n[00:52.248]求你别要如从前纯熟地碰我\n[00:55.959]而我问我为何还能够碰伤我\n[00:59.678]不要让我 一败涂地\n[01:03.404]输得更多\n[01:06.322]求你别说错过我其实亦爱我\n[01:10.035]何以技痒放过我\n[01:12.437]你已仿佛有神助\n[01:15.623]一关心我已经\n[01:19.070]等于再杀死我\n[01:28.370]你未提及我也知\n[01:31.820]既是前度没法子\n[01:34.749]如这圣伯纳得意\n[01:38.727]分予你当玩意\n[01:42.445]数十年后我也知\n[01:45.373]如果见你我愿意\n[01:49.088]像一关过完再单打一次\n[01:56.253]我道行都低估了你\n[01:59.450]我以为撑得起\n[02:02.901]一句为什么不找找你\n[02:06.349]我练到再倔强 再绝也\n[02:09.280]也永没法比\n[02:12.729]求你别要如从前纯熟地碰我\n[02:16.711]而我问我为何还能够碰伤我\n[02:20.434]不要让我 一败涂地\n[02:23.621]输得更多\n[02:26.808]求你别说错过我其实亦爱我\n[02:30.787]何以技痒放过我\n[02:32.921]你已仿佛有神助\n[02:36.106]一关心我已经\n[02:39.817]等于再杀死我\n[02:54.966]求你别说仍能如良朋地对我\n[02:58.684]而我问我为何还能对得起我\n[03:02.398]不要让我 一败涂地\n[03:06.124]输得更多\n[03:08.776]求你别说错过我其实亦爱我\n[03:12.760]何以技痒放过我\n[03:15.077]你已仿佛有神助\n[03:18.605]一讲起你已经\n[03:21.793]等于再杀死我\n"
                    },
                    {
                        url: "/src/assets/airukongqi-cuizige.mp3",
                        pic: "/src/assets/cuizige-130.jpg",
                        title: "爱如空气",
                        singer: "崔子格",
                        source: "喜粤",
                        lyric: "[00:00.000] 作词 : 张美贤\n[00:01.000] 作曲 : 李海鹰\n[00:06.876]原词：崔恕\n[00:09.644]改编词：张美贤\n[00:12.060]编曲：周禹成\n[00:15.262] \n[00:19.559]风筝一早断线 荡进风里\n[00:24.910]思忆翻开雨季 天空流泪\n[00:29.531]早春这四月  停留伞里\n[00:34.261]沾湿了我 思绪\n[00:38.661]花火一早散去 没有依据\n[00:43.094]车厢顷刻远去 怎么团聚\n[00:47.560]匆匆每串往事 迷糊细碎\n[00:52.060]应该哪里  再去追\n[00:58.011] \n[00:58.893]和你一早已经不会在一起\n[01:03.594]为何世界 我天与地\n[01:07.893]留着你每一幕 无色无气味\n[01:12.545]却轻得仿似透明 呼吸的氧气\n[01:16.961] \n[01:17.277]和你分开也都感觉在一起\n[01:21.644]蔓延四季 超出生死\n[01:26.161]怀念你每一夜 回忆无故地\n[01:30.660]重得张开了翅膀 我都飞不起\n[01:38.393]仍想念你\n[01:43.311] \n[01:58.043]花火一早散去 没有依据\n[02:02.160]车厢顷刻远去 怎么团聚\n[02:06.676]匆匆每串往事 迷糊细碎\n[02:11.512]应该哪里  再去追\n[02:18.011]和你一早已经不会在一起\n[02:22.594]为何世界 我天与地\n[02:27.260]留着你每一幕 无色无气味\n[02:31.748]却轻得仿似透明 呼吸的氧气\n[02:36.266] \n[02:36.516]和你分开也都感觉在一起\n[02:40.783]蔓延四季 超出生死\n[02:45.133]怀念你每一夜 回忆无故地\n[02:49.754]重得张开了翅膀 我都飞不起\n[02:55.549]逐段逐分想你 仿佛野蔷薇碎开的凄美\n[03:03.334]这是梦幻又像现实 难逃避\n[03:07.598]难道爱你似寻求空气\n[03:14.146]\n[03:14.834]和你一早已经不会在一起\n[03:19.258]为何世界 我天与地\n[03:23.610]留着你每一幕 无色无气味\n[03:28.360]却轻得仿似透明 呼吸的氧气\n[03:32.958]和你分开也都感觉在一起\n[03:37.275]蔓延四季 超出生死\n[03:41.774]怀念你每一夜 回忆无故地\n[03:46.428]重得张开了翅膀 我都飞不起\n[03:54.226]仍想念你\n[04:01.143]\n[04:02.659]制作人：周禹成\n[04:04.343]混音：周天澈\n[04:05.726]吉他：赵勤\n[04:06.726]键盘：段阿翥\n[04:07.726]弦乐监制 ：付威\n[04:08.726]弦乐 ：中国国际爱乐乐团\n"
                    }
                ],
            };
        },
    },
];